cert_uploader/templates/createCertObjectTemplate.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<dp:request domain="ZULAZULADOMAINNAMEZULA"
			xmlns:dp="http://www.datapower.com/schemas/management">
			<dp:set-config>
				<CryptoCertificate name="ZULAZULACERTOBJECTNAMEZULAZULA">
					<!--Optional:-->
					<mAdminState>enabled</mAdminState>
					<!--You have a CHOICE of the next 5 items at this level-->
					<!--Optional:-->
					<Filename>cert:///ZULAZULACERTFILENAMEONDPZULAZULA.pem</Filename>
					<!--Optional:-->
					<Password></Password>
					<!--Optional:-->
					<PasswordAlias></PasswordAlias>
					<!--Optional:-->
					<Alias class="?"></Alias>
					<!--Optional:-->
					<IgnoreExpiration>off</IgnoreExpiration>
				</CryptoCertificate>
			</dp:set-config>
		</dp:request>
	</soapenv:Body>
</soapenv:Envelope>
